VatEngine/src/test/resources/GCC_LOCALSALEOFSERVICES_Test12.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?>
<?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?>
<iVATEngineInput>
	<Supplier>
		<ID>112216</ID>
		<Name>SACOMPANY</Name>
		<Address/>
		<ZIP/>
		<City/>
		<Country>SA</Country>
		<RegOfCommerce/>
		<BancAccountNumber/>
		<IBAN/>
		<BIC/>
		<TelephoneNumber/>
		<FaxNumber/>
		<EmailAddress/>
		<SpecialType>0</SpecialType>
		<DeductionType>0</DeductionType>
		<VATNumberSupplier Country="SA">
			<VATNumber>SA123456789</VATNumber>
			<VATNumberType>3</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<TaxNumber/>
			<BelongsToFiscalUnit>0</BelongsToFiscalUnit>
		</VATNumberSupplier>
		<CountryChosenVATNumber>SA</CountryChosenVATNumber>
	</Supplier>
	<Customer>
		<ID>112216</ID>
		<Name>SACOMPANY B</Name>
		<Address>2</Address>
		<ZIP/>
		<City/>
		<EmailAddress/>
		<Country>SA</Country>
		<SpecialType>0</SpecialType>
		<VATNumberCustomer Country="SA">
			<VATNumber>SA123456780</VATNumber>
			<VATNumberType>3</VATNumberType>
			<Name/>
			<Address1/>
			<Address2/>
			<Address3/>
			<RequiredOnInvoicePicture>false</RequiredOnInvoicePicture>
			<BelongsToFiscalUnit>1</BelongsToFiscalUnit>
		</VATNumberCustomer>
		<CountryChosenVATNumber>SA</CountryChosenVATNumber>
		<TypeOfGoods>0</TypeOfGoods>
	</Customer>
	<InvoiceProperties>
		<DocumentType>0</DocumentType>
		<Disconto>0</Disconto>
		<Currency1>EUR</Currency1>
		<InvoiceNumber/>
		<ReferenceInvoiceNumber/>
		<InvoiceDate>2019-02-11</InvoiceDate>
		<OfficialLanguage>3</OfficialLanguage>
	</InvoiceProperties>
	<Item ID="1">
		<Properties>
			<Description/>
			<InternationalDescription LanguageID="1">advies diensten, informatieverstrekking (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="2">transmissions d&#180;informations (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="3">consultancy services, supplying of information (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="4">suministro de informacion (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="5">lieferung information  (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="6">comunicaçao de informações (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="7">trasmissione di informazioni (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="10">tiedonhankinta (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="11">informationsöverföring (-215-)</InternationalDescription>
			<InternationalDescription LanguageID="15">informacijas piegade (-215-)</InternationalDescription>
			<TaricCode/>
			<CPCCode/>
			<Amounts CurrencyNumber="1">
				<UnitPriceExclVAT>100</UnitPriceExclVAT>
				<TotalAmountExclVAT>100</TotalAmountExclVAT>
				<PackagingCosts>0</PackagingCosts>
			</Amounts>
			<Number>1</Number>
			<Unit/>
			<VATRate>5</VATRate>
			<Reduction>0</Reduction>
			<AdditionalProperties>
				<PropertiesPerCountry Country="SA">
					<VATRateCode>S</VATRateCode>
				</PropertiesPerCountry>
				<EngineParameter1/>
				<EngineParameter2>C0D</EngineParameter2>
				<EngineParameter3>A</EngineParameter3>
			</AdditionalProperties>
			<ItemClassificationCode>215</ItemClassificationCode>
			<OutOfVAT>0</OutOfVAT>
		</Properties>
		<Conditions>
			<ContinuousSupply>0</ContinuousSupply>
			<CountryOperation>SA</CountryOperation>
			<DateTransaction>2019-02-11</DateTransaction>
		</Conditions>
	</Item>
	<AmountsSummary CurrencyNumber="1">
		<VATTotals VATRate="5">
			<AmountDisconto>0</AmountDisconto>
			<AmountExclVAT>100</AmountExclVAT>
			<AmountVAT>5</AmountVAT>
		</VATTotals>
		<Totals>
			<TotalAmountVAT>5</TotalAmountVAT>
			<TotalAmountInclVAT>105</TotalAmountInclVAT>
			<TotalAmountDisconto>0</TotalAmountDisconto>
			<TotalAmountInclVATCash>105</TotalAmountInclVATCash>
			<TotalAmountPackagingCosts>0</TotalAmountPackagingCosts>
		</Totals>
	</AmountsSummary>
	<CheckValue>100</CheckValue>
</iVATEngineInput>]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>